arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_aux_evctl.h
// Field:     [3] AUX_COMPA
//
// Selects the event source level that sets EVTOAONFLAGS.AUX_COMPA.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA                              0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_BITN                                  3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_M                            0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_S                                     3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_LOW                          0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_HIGH                         0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_DMACTL
//
//*****************************************************************************
// Field:     [2] REQ_MODE
//
// DMA Request mode
// ENUMs:
// SINGLE                   Single requests are generated on DMA channel 7 when
// the condition configured in SEL is met
// BURST                    Burst requests are generated on DMA channel 7 when
// the condition configured in SEL is met
#define AUX_EVCTL_DMACTL_REQ_MODE                                   0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_BITN                                       2
#define AUX_EVCTL_DMACTL_REQ_MODE_M                                 0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_S                                          2
#define AUX_EVCTL_DMACTL_REQ_MODE_SINGLE                            0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_BURST                             0x00000000

// Field:     [1] EN
//
// 0: DMA interface is disabled
// 1: DMA interface is enabled
#define AUX_EVCTL_DMACTL_EN                                         0x00000002
#define AUX_EVCTL_DMACTL_EN_BITN                                             1
#define AUX_EVCTL_DMACTL_EN_M                                       0x00000002
#define AUX_EVCTL_DMACTL_EN_S                                                1

// Field:     [0] SEL
//
// Selection of FIFO watermark level required to trigger an ADC_DMA transfer
// ENUMs:
// FIFO_ALMOST_FULL         ADC_DMA event will be generated when the ADC FIFO
// is almost full (3/4 full)
// FIFO_NOT_EMPTY           ADC_DMA event will be generated when there are
// valid samples in the ADC FIFO
#define AUX_EVCTL_DMACTL_SEL                                        0x00000001
#define AUX_EVCTL_DMACTL_SEL_BITN                                            0
#define AUX_EVCTL_DMACTL_SEL_M                                      0x00000001
#define AUX_EVCTL_DMACTL_SEL_S                                               0
#define AUX_EVCTL_DMACTL_SEL_FIFO_ALMOST_FULL                       0x00000001
#define AUX_EVCTL_DMACTL_SEL_FIFO_NOT_EMPTY                         0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SWEVSET
//
//*****************************************************************************
// Field:     [2] SWEV2
//
// Writing 1 sets software event 2.
//
// For the MCU domain, the event flag can be read from EVTOAONFLAGS.SWEV2 and
// cleared using EVTOAONFLAGSCLR.SWEV2.
#define AUX_EVCTL_SWEVSET_SWEV2                                     0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_BITN                                         2
#define AUX_EVCTL_SWEVSET_SWEV2_M                                   0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_S                                            2

// Field:     [1] SWEV1
//
// Writing 1 sets software event 1.
//
// For the MCU domain, the event flag can be read from EVTOAONFLAGS.SWEV1 and
// cleared using EVTOAONFLAGSCLR.SWEV1.
#define AUX_EVCTL_SWEVSET_SWEV1                                     0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_BITN                                         1
#define AUX_EVCTL_SWEVSET_SWEV1_M                                   0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_S                                            1

// Field:     [0] SWEV0
//
// Writing 1 sets software event 0.
//
// For the MCU domain, the event flag can be read from EVTOAONFLAGS.SWEV0 and
// cleared using EVTOAONFLAGSCLR.SWEV0.
#define AUX_EVCTL_SWEVSET_SWEV0                                     0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_BITN                                         0
#define AUX_EVCTL_SWEVSET_SWEV0_M                                   0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_S                                            0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVSTAT0
//
//*****************************************************************************
// Field:    [15] AUXIO2
//
// Current value of AUXIO2 input data line
#define AUX_EVCTL_EVSTAT0_AUXIO2                                    0x00008000
#define AUX_EVCTL_EVSTAT0_AUXIO2_BITN                                       15
#define AUX_EVCTL_EVSTAT0_AUXIO2_M                                  0x00008000
#define AUX_EVCTL_EVSTAT0_AUXIO2_S                                          15

// Field:    [14] AUXIO1
//
// Current value of AUXIO1 input data line
#define AUX_EVCTL_EVSTAT0_AUXIO1                                    0x00004000
#define AUX_EVCTL_EVSTAT0_AUXIO1_BITN                                       14
#define AUX_EVCTL_EVSTAT0_AUXIO1_M                                  0x00004000
#define AUX_EVCTL_EVSTAT0_AUXIO1_S                                          14

// Field:    [13] AUXIO0
//
// Current value of AUXIO0 input data line
#define AUX_EVCTL_EVSTAT0_AUXIO0                                    0x00002000
#define AUX_EVCTL_EVSTAT0_AUXIO0_BITN                                       13
#define AUX_EVCTL_EVSTAT0_AUXIO0_M                                  0x00002000
#define AUX_EVCTL_EVSTAT0_AUXIO0_S                                          13

